       IDENTIFICATION DIVISION.

       PROGRAM-ID. TSQL001A.


       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

GIXSQL*    EXEC SQL
GIXSQL*      INCLUDE EMPREC
GIXSQL*    END-EXEC.
           COPY EMPREC.

           01 DATASRC PIC X(64).
           01 DBUSR  PIC X(64).
           01 DBPWD  PIC X(64).

           01 T1     PIC 9(3) VALUE 0.

GIXSQL*    EXEC SQL
GIXSQL*      INCLUDE SQLCA
GIXSQL*    END-EXEC.
           COPY SQLCA.
GIXSQL*
GIXSQL 01  SQ0001.
GIXSQL     02  FILLER PIC X(0031) VALUE "SELECT COUNT( * ) FROM EMPTAB"
GIXSQL  &  "LE".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL*   ESQL CURSOR INIT FLAGS (START)
GIXSQL*   ESQL CURSOR INIT FLAGS (END)
       PROCEDURE DIVISION.

       000-CONNECT.
           ACCEPT DATASRC FROM ENVIRONMENT 'DB1name'.
           ACCEPT DBUSR FROM ENVIRONMENT 'DB1role'.
           ACCEPT DBPWD FROM ENVIRONMENT 'DB1pswd'.

      D     DISPLAY '***************************************'.
      D     DISPLAY " DATASRC  : " DATASRC.
      D     DISPLAY " DBUSR    : " DBUSR.
      D     DISPLAY " DBPWD    : " DBPWD.
      D     DISPLAY '***************************************'.

GIXSQL*    EXEC SQL
GIXSQL*       CONNECT TO :DATASRC USER :DBUSR USING :DBPWD
GIXSQL*    END-EXEC.
GIXSQL     CALL STATIC "GIXSQLConnect" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE DATASRC
GIXSQL         BY VALUE 64
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE DBUSR
GIXSQL         BY VALUE 64
GIXSQL         BY REFERENCE DBPWD
GIXSQL         BY VALUE 64
GIXSQL     END-CALL.

           DISPLAY 'CONNECT SQLCODE: ' SQLCODE

           IF SQLCODE <> 0 THEN
              GO TO 100-EXIT
           END-IF.

       100-MAIN.

      *     EXEC SQL
      *        START TRANSACTION
      *     END-EXEC.

GIXSQL*    EXEC SQL
GIXSQL*        SELECT COUNT(*) INTO :T1 FROM EMPTABLE
GIXSQL*    END-EXEC.
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 3
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE T1
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecSelectIntoOne" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0001
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 1
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL.

           DISPLAY 'SELECT SQLCODE : ' SQLCODE.

           IF SQLCODE <> 0 THEN
              GO TO 100-EXIT
           END-IF.

           DISPLAY 'Number of Records: ' T1.

GIXSQL*    EXEC SQL CONNECT RESET END-EXEC.
GIXSQL     CALL STATIC "GIXSQLConnectReset" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL     END-CALL.

       100-EXIT.
      *       STOP RUN.
GIXSQL*
GIXSQL*   ESQL CURSOR DECLARATIONS (START)
GIXSQL     GO TO GIX-SKIP-CRSR-INIT.
GIXSQL GIX-SKIP-CRSR-INIT.
GIXSQL*
GIXSQL*   ESQL CURSOR DECLARATIONS (END)
